{
    "internationalizations": [
        {
            "language": "pt",
            "description": "Desde criança, a tecnologia sempre me encantou. As possibilidades da invenção e inovação eram como mágica para mim. Venho de uma família de desenvolvedores, mas foi somente na escola, nos cursos de robótica e computação na escola, que eu descobri que a minha paixão por tecnologia realmente estava em minhas veias.<br><br>Anos mais tarde, durante meu bacharelado em Ciência da Computação pela <i>Pontifícia Universidade Católica de São Paulo (PUC-SP)</i>, tive a oportunidade de aprender todos os teoremas, teorias e algoritmos que possibilitavam a mágica acontecer. No final da graduação, consegui um do estágio no <i>Itaú Unibanco S.A.</i>, o maior banco da América Latina, e pude finalmente pôr em prática minhas habilidades durante o desenvolvimento de grandes sistemas bancários ao lado de profissionais incríveis e generosos, sempre dispostos a compartilhar seus conhecimentos comigo.<br><br>Desde então, junto de profissionais incríveis, realizei migrações de sistemas legados <i>mainframe</i> para o ambiente <i>PaaS</i> e para a <i>Cloud Pública AWS</i>, atuando no levantamento de requisitos, desenho de arquitetura, implementação e entrega de microsserviços em uma plataforma distribuída, escalável e resiliente.<br><br>Atualmente, sou uma profissional com certificação <i>AWS Certified Cloud Practitioner</i> que procura aplicar os conhecimentos adquiridos com a experiência na engenharia de software, buscando novas habilidades e aprendendo todo dia com os desafios e oportunidades que surgem no meu caminho."
        },
        {
            "language": "en",
            "description": "Since I was a child, technology has always fascinated me. The possibilities of innovation and invention were like magic to me. I come from a family of developers, but it wasn't until school, in robotics and computing courses, that I discovered that my passion for technology really ran in my veins.<br><br>Years later, during my bachelor's degree in Computer Science at the <i>Pontifical Catholic University of São Paulo (PUC-SP)</i>, I had the opportunity to learn all the theorems, foundations, theories and algorithms that made magic happen.<br><br>At the end of graduation, I got an internship at <i>Itaú Unibanco S.A.</i>, the largest bank in Latin America, and since then, alongside outstanding professionals, I have carried out migrations from <i>mainframe</i> legacy systems to the <i>PaaS</i> environment and the <i>AWS Public Cloud</i>, working on requirements gathering, architecture design, implementation and deployment of microservices on a distributed, scalable and resilient architecture.<br><br>Currently, I am an <i>AWS Certified Cloud Practitioner</i> professional who seeks to apply the knowledge acquired from the experience in software engineering, looking for new skills in different technologies and learning every day with the challenges and opportunities that come my way."
        }
    ],
    "medias": [        
        {
            "icon": "linkedin",
            "title": "LinkedIn",
            "http": "https://www.linkedin.com/in/mariana-bayona/"
        },
        {
            "icon": "github",
            "title": "GitHub",
            "http": "https://github.com/MarianaBayona"
        }
    ],
    "hobbies": [        
        {
            "icon": "music",
            "title": "Music"
        },
        {
            "icon": "gamepad",
            "title": "Game"
        },
        {
            "icon": "suitcase-rolling",
            "title": "Travel"
        },
        {
            "icon": "book",
            "title": "Read"
        }
    ]
}